
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ВосстановитьДанныеТабличныхЧастейНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВосстановитьДанныеТабличныхЧастейНаСервере()
	ОбъектНаСервере = РеквизитФормыВЗначение("Объект");
	
	ИменаТабличныхЧастей = Новый Массив;
	
	ИменаТабличныхЧастей.Добавить("Состав");
	
	Для Каждого Имя Из ИменаТабличныхЧастей Цикл
		ЗагруженныеНастройки = ХранилищеОбщихНастроек.Загрузить(ЭтаФорма, Имя);
		Если ЗначениеЗаполнено(ЗагруженныеНастройки) Тогда
			ОбъектНаСервере[Имя].Загрузить(ЗагруженныеНастройки);
		КонецЕсли;
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ОбъектНаСервере, "Объект");
КонецПроцедуры

&НаСервере
Процедура СохранитьДанныеТабличныхЧастейНаСервере()
	ИменаТабличныхЧастей = Новый Массив;
	
	ИменаТабличныхЧастей.Добавить("Состав");
	
	Для Каждого Имя Из ИменаТабличныхЧастей Цикл
		ХранилищеОбщихНастроек.Сохранить(ЭтаФорма, Имя, Объект[Имя].Выгрузить()); 
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СоставПутьНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.Состав.ТекущиеДанные;
	
	ВыборФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	ВыборФайла.Фильтр = "Внешняя обработка (*.epf)|*.epf|Внешний отчет (*.erf)|*.erf";
	
	ВыборФайла.Показать(Новый ОписаниеОповещения("СоставПутьНачалоВыбораЗавершение", ЭтотОбъект, ТекущиеДанные));
КонецПроцедуры

&НаКлиенте
Процедура СоставПутьНачалоВыбораЗавершение(ВыбранныеФайлы, ТекущиеДанные) Экспорт
	Если Ложь
		Или ВыбранныеФайлы = Неопределено
		Или ВыбранныеФайлы.Количество() = 0
		Тогда
		
		Возврат;
	КонецЕсли;
	
	Файл = Новый Файл(ВыбранныеФайлы[0]);
	
	ТекущиеДанные.Путь = Файл.ПолноеИмя;
	ТекущиеДанные.ЭтоОбработка = Файл.Расширение = ".epf";
	
	ПараметрыЗаполнения = Новый Структура;
	
	ПараметрыЗаполнения.Вставить("НомерСтроки", ТекущиеДанные.НомерСтроки);
	ПараметрыЗаполнения.Вставить("ЭтоОбработка", ТекущиеДанные.ЭтоОбработка);
	
	ЗаполнитьОставшиесяРеквизиты(Файл.ПолноеИмя, ПараметрыЗаполнения);
	
	СохранитьДанныеТабличныхЧастейНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОставшиесяРеквизиты(ПолноеИмя, ПараметрыЗаполнения) 
	Адрес = "";

	НачатьПомещениеФайла(Новый ОписаниеОповещения("НачатьПомещениеФайлаЗавершение", ЭтотОбъект, ПараметрыЗаполнения), Адрес, ПолноеИмя, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура НачатьПомещениеФайлаЗавершение(Результат, Адрес, ВыбранноеИмяФайла, ПараметрыЗаполнения) Экспорт
	Если Результат Тогда
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(Адрес);
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
		ДвоичныеДанные.Записать(ИмяВременногоФайла);
		
		ЗаполнитьОставшиесяРеквизитыНаСервере(ИмяВременногоФайла, ПараметрыЗаполнения);
		
		Файл = Новый Файл(ИмяВременногоФайла);

		Файл.НачатьПроверкуСуществования(Новый ОписаниеОповещения("НачатьПроверкуСуществованияЗавершение", ЭтотОбъект, ИмяВременногоФайла));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НачатьПроверкуСуществованияЗавершение(Существует, ИмяВременногоФайла) Экспорт
	Если Существует Тогда
		НачатьУдалениеФайлов(Новый ОписаниеОповещения("НачатьУдалениеФайловЗавершение", ЭтотОбъект), ИмяВременногоФайла);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НачатьУдалениеФайловЗавершение(РезультатВызова) Экспорт

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОставшиесяРеквизитыНаСервере(ИмяВременногоФайла, ПараметрыЗаполнения)
	ОбъектНаСервере = РеквизитФормыВЗначение("Объект");
	
	ИскомаяСтрока = ОбъектНаСервере.Состав.Найти(ПараметрыЗаполнения.НомерСтроки, "НомерСтроки");
	Если ИскомаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ВнешняяОбработка = Неопределено;
	Если ПараметрыЗаполнения.ЭтоОбработка Тогда
		ВнешняяОбработка = ВнешниеОбработки.Создать(ИмяВременногоФайла, Ложь);
		
	Иначе
		ВнешняяОбработка = ВнешниеОтчеты.Создать(ИмяВременногоФайла, Ложь);
		
	КонецЕсли;
	
	МетаданныеВнешнейОбработки = ВнешняяОбработка.Метаданные();
	
	ИскомаяСтрока.Имя = МетаданныеВнешнейОбработки.Имя;

	Формы = "";
	
	ФормыВнешнейОбработки = МетаданныеВнешнейОбработки.Формы;
	Для Каждого Форма Из ФормыВнешнейОбработки Цикл
		Формы = Формы + Форма.Имя + ";";
	КонецЦикла;
	
	ИскомаяСтрока.Формы = Формы;
	
	ЗначениеВРеквизитФормы(ОбъектНаСервере, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура СоставФормаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	СписокФорм = Новый СписокЗначений;
	
	СписокФорм.Добавить("1", "1");
	СписокФорм.Добавить("2", "2");
	
	ПоказатьВыборИзСписка(Новый ОписаниеОповещения("СоставФормаНачалоВыбораЗавершение", ЭтотОбъект), СписокФорм, Элементы.СоставФорма);
КонецПроцедуры

&НаКлиенте
Процедура СоставФормаНачалоВыбораЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт

КонецПроцедуры

&НаКлиенте
Процедура СоставВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Имя = "СоставИмя" Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "о_О";
		Сообщение.Сообщить();	
				
	КонецЕсли;
КонецПроцедуры
