# encoding: utf-8
# language: ru

Функционал: Проверка относительных имен файлов обработок stack commons

Как Разработчик Vanessa Stack
Хочу Иметь верные относительные имена файлов обработок
Чтобы Обеспечить корректную работу обработок использующих stack commons

Сценарий: Чтение фич
	Дано Имя файла обработки для чтения фич корректно

Сценарий: Запись фич
	Дано Имя файла обработки для записи фич корректно

Сценарий: Чтение фикстур
	Дано Имя файла обработки для чтения фикстур корректно

Сценарий: Запись фикстур
	Дано Имя файла обработки для записи фикстур корректно
	