
Процедура КнопкаВыполнитьНажатие(Кнопка)
	// Вставить содержимое обработчика.
КонецПроцедуры


Функция ПолучитьПутьКФайлОтносительноКаталогоFeatures(ИмяФайлаСРасширением)
	ПутьКФайлу = "";

	ПутьКТекущемуFeatureФайлу = Ванесса.КаталогФич;
	
	ПутьКФайлу = Лев(ПутьКТекущемуFeatureФайлу, Найти(ПутьКТекущемуFeatureФайлу, "features") - 1) + ИмяФайлаСРасширением;
	
	Возврат ПутьКФайлу;
КонецФункции

Процедура ЗагрузитьFixtureИзМакета(ИмяМакета)
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
	
	Текст = ПолучитьМакет(ИмяМакета).ПолучитьТекст();
	
	ВременныйДокумент = Новый ТекстовыйДокумент;
	ВременныйДокумент.УстановитьТекст(Текст);
	ВременныйДокумент.Записать(ИмяВременногоФайла, КодировкаТекста.UTF8);
	
	ПутьКВнешнейОбработке = ПолучитьПутьКФайлОтносительноКаталогоFeatures("tools\ВыгрузкаЗагрузкаДанныхXML82.epf");
	
	ВнешняяОбработка = ВнешниеОбработки.Создать(ПутьКВнешнейОбработке, Ложь);
	
	ВнешняяОбработка.ВыполнитьЗагрузку(ИмяВременногоФайла);
КонецПроцедуры
