
&НаКлиенте
Перем УИН;

&НаКлиенте
Процедура Команда1(Команда)
	ФормаСправочника = ПолучитьФорму("Справочник.Справочник1.ФормаСписка");
	ФормаСправочника.КлючУникальности = УИН;
	
	ФормаСправочника.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура Команда2(Команда)
	ОткрытыеОкна = ПолучитьОкна();
	Для Каждого ОткрытоеОкно Из ОткрытыеОкна Цикл
		СодержимоеОкна = ОткрытоеОкно.Содержимое;
		Если СодержимоеОкна.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если СодержимоеОкна[0].КлючУникальности = УИН Тогда
			//Нашел открытую мной форму
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

УИН = Новый УникальныйИдентификатор();
