# encoding: utf-8
# language: ru

Функционал: Проверка относительных имен файлов обработок stack commons

Как Разработчик Vanessa Stack
Хочу Иметь верные относительные имена файлов обработок
Чтобы Обеспечить корректную работу обработок использующих stack commons

Сценарий: Чтение фич
	Дано: Относительное имя файла обработки для чтения фич следующее "sbFeatureReader.epf"

Сценарий: Запись фич
	Дано: Относительное имя файла обработки для записи фич следующее "sbFeatureWriter.epf"

Сценарий: Чтение фикстур
	Дано: Относительное имя файла обработки для чтения фикстур следующее "sbFixturesReader.epf"

Сценарий: Запись фикстур
	Дано: Относительное имя файла обработки для записи фикстур следующее "sbFixturesWriter.epf"
	