#encoding: utf-8
#language: ru

Функционал: Построчное получение feature файла                                                                                                            
	Как пользователь библиотек Commons                                                                                                                    
	Я хочу построчное чтение feature файла                                                                                                                
	Чтобы иметь возможность построчно забирать и обрабатывать данные, в том числе получить определенную строку                                            
	
Контекст:
	Дано 

Сценарий:
	Когда
	И
	Тогда

Сценарий:
	Когда
	И
	Тогда

Сценарий:
	Когда
	И
	Тогда
