#encoding: utf-8
#language: ru

Функционал: Получение полного текста feature файла                                                                                                        
	Как пользователь библиотек Commons                                                                                                                    
	Я хочу получить полный текст feature файла                                                                                                            
	Чтобы читать feature файл и вести дальнейшую обработку                                                                                                
	
Контекст:
	Дано 

Сценарий:
	Когда
	И
	Тогда
