#encoding: utf-8
#language: ru

Функционал: Получение заголовков feature файлов                                                                                                           
	Как пользователь библиотек Commons                                                                                                                    
	Я хочу получить заголовки feature файлов                                                                                                              
	Чтобы формировать структуру для анализа в BDD-Editor                                                                                                  
	
Контекст:
	Дано 

Сценарий:
	Когда
	И
	Тогда

Сценарий:
	Когда
	И
	Тогда

Сценарий:
	Когда
	И
	Тогда
