#encoding: utf-8
#language: ru

Функционал: Построчное получение feature файла                                                                                                            
	Как пользователь библиотек Commons                                                                                                                    
	Я хочу построчное чтение feature файла                                                                                                                
	Чтобы иметь возможность построчно забирать и обрабатывать данные, в том числе получить определенную строку                                            
	
Контекст:
	Дано Обработка использующая библиотеки Commons

Сценарий: Построчное чтение всего feature-файла 
	Когда
	И
	Тогда

Сценарий: Получение строки feature-файла по номеру
	Когда
	И
	Тогда

Сценарий: Получение отрывка feature-файла между номерами строк
	Когда
	И
	Тогда
