#encoding: utf-8
#language: ru

Функционал: Получение feature файла в виде дерева                                                                                                         
	Как пользователь библиотек Commons                                                                                                                    
	Я хочу чтение feature файла в структурированном разбитом виде                                                                                         
	Чтобы формировать дерево для последующей обработки                                                                                                    
	
Контекст:
	Дано 

Сценарий:
	Когда
	И
	Тогда

Сценарий:
	Когда
	И
	Тогда

Сценарий:
	Когда
	И
	Тогда

Сценарий:
	Когда
	И
	Тогда
